def start_text(name: str):
    return f"""
Добро пожаловать {name}👋

📡 Сервис который помогает ускорить интернет

Мы запускаем новый сервис

⚡️ Преимущества:
• Стабильная работа 
• Самые быстрые сервера
• Отзывчивая поддержка
• Работает на любых устройствах

📲 Как подключиться:
→ Нажмите «Получить ключ»
→ Скачайте приложение (при необходимости)
→ Следуйте шагам инструкции"""

def support_text():
    return """🗒 Опишите возникшую проблему"""

def text_setings():
    return"""
🔊Настройка для работы сайтов из белых списков

1️⃣Зайдите в приложение v2RayTun

2️⃣Внизу вы заметите значок в виде шестерни, нажмите на него

3️⃣После нажатия в пунктах вы должны найти "Маршрутизация" переходим в неё

4️⃣Дальше жмем "Маршрутизация выбранных приложений"

5️⃣Тут вы увидите два пункта настройки "Маршрутизация выбранных приложений" и "Режим обхода" оба пункта переводим из состояния выкл. в состояние вкл.

6️⃣Спускаемся ниже и находим в списке приложение связанные с белыми списками и переводим их в состояние вкл. (для упрощения поиска можете  пункт "Исключить системные" перевести в состояние вкл.)

7️⃣Выключите и включите обход на начальной странице (на которую вы попадаете когда заходите в приложение v2RayTun)"""

def info_limit_ip():
    return """***Дисклеймер***


При покупке подписки вам будет доступно одно устройство для подключения,
это не означает что если вы активируете его на телефоне то доступ будет только на нем и больше ничего подключить нельзя будет,
все совсем иначе если вам нужно будет активировать ключ на компьютере, планшете или на каком либо еще устройстве,
то вам достаточно будет выключить ключ на одном устройстве и активировать его на другом,
главное что бы ключ не работал на двух устройствах одновременно,
При этом если вы находитесь дома и у вас все устройства подключены к wi-fi 
то вы можете подключить все устройства подключеные к одному wi-fi на один ключ так как это все еще считается одним устройством
из-за того что все ваши устройства в такой ситуации имеют один и тот же ip адрес в интернете

***Дополнительные устройства и стоимость их подключения***


У нашего бота есть возможность подключать дополнительные места на ваши ключи, стоимость одного места расчитывается из колличества месяцев
которое у вас осталось, то есть если до окончания подписки у вас осталось 15 дней, и произошло так что вам понадобилось дополнительно подключить что-то или кого-то еще
то стоиость будет такая же как и если бы вы вы покупали дополнительный слот в начале месяца (150руб), соответственно если до окончания подписки 45 дней то
стоимость дополнительного устройства уже 300 рублей, по этому призываем вас задуматься сразу о приобретении дополнительных слотов под устройства"""